Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/soc_reg.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Goal:     stm32L4R5 equates.
 *           Generated using the .svd description
 */

#pragma once

// IWYU pragma: begin_exports

#include    "Registers/soc_vectors.h"
#include    "Registers/stm32L4R5_adc.h"
#include    "Registers/stm32L4R5_adc_common.h"
#include    "Registers/stm32L4R5_aes.h"
#include    "Registers/stm32L4R5_can.h"
#include    "Registers/stm32L4R5_comp.h"
#include    "Registers/stm32L4R5_crc.h"
#include    "Registers/stm32L4R5_crs.h"
#include    "Registers/stm32L4R5_dac.h"
#include    "Registers/stm32L4R5_dbgmcu.h"
#include    "Registers/stm32L4R5_dcmi.h"
#include    "Registers/stm32L4R5_dfsdm.h"
#include    "Registers/stm32L4R5_dma.h"
#include    "Registers/stm32L4R5_dma2d.h"
#include    "Registers/stm32L4R5_dmamux.h"
#include    "Registers/stm32L4R5_exti.h"
#include    "Registers/stm32L4R5_firewall.h"
#include    "Registers/stm32L4R5_flash.h"
#include    "Registers/stm32L4R5_fmc.h"
#include    "Registers/stm32L4R5_gfxmmu.h"
#include    "Registers/stm32L4R5_gpioa.h"
#include    "Registers/stm32L4R5_gpiob.h"
#include    "Registers/stm32L4R5_gpioc.h"
#include    "Registers/stm32L4R5_gpiod.h"
#include    "Registers/stm32L4R5_gpioe.h"
#include    "Registers/stm32L4R5_gpiof.h"
#include    "Registers/stm32L4R5_gpiog.h"
#include    "Registers/stm32L4R5_gpioh.h"
#include    "Registers/stm32L4R5_gpioi.h"
#include    "Registers/stm32L4R5_hash.h"
#include    "Registers/stm32L4R5_i2c.h"
#include    "Registers/stm32L4R5_iwdg.h"
#include    "Registers/stm32L4R5_lcd.h"
#include    "Registers/stm32L4R5_lptim.h"
#include    "Registers/stm32L4R5_lpuart1.h"
#include    "Registers/stm32L4R5_octospi.h"
#include    "Registers/stm32L4R5_octospim.h"
#include    "Registers/stm32L4R5_opamp.h"
#include    "Registers/stm32L4R5_otg_fs_device.h"
#include    "Registers/stm32L4R5_otg_fs_global.h"
#include    "Registers/stm32L4R5_otg_fs_host.h"
#include    "Registers/stm32L4R5_otg_fs_pwrclk.h"
#include    "Registers/stm32L4R5_pwr.h"
#include    "Registers/stm32L4R5_rcc.h"
#include    "Registers/stm32L4R5_rng.h"
#include    "Registers/stm32L4R5_rtc.h"
#include    "Registers/stm32L4R5_sai.h"
#include    "Registers/stm32L4R5_sdio.h"
#include    "Registers/stm32L4R5_spi.h"
#include    "Registers/stm32L4R5_stk.h"
#include    "Registers/stm32L4R5_swpmi.h"
#include    "Registers/stm32L4R5_syscfg.h"
#include    "Registers/stm32L4R5_tim1.h"
#include    "Registers/stm32L4R5_tim15.h"
#include    "Registers/stm32L4R5_tim16.h"
#include    "Registers/stm32L4R5_tim17.h"
#include    "Registers/stm32L4R5_tim2.h"
#include    "Registers/stm32L4R5_tim3.h"
#include    "Registers/stm32L4R5_tim4.h"
#include    "Registers/stm32L4R5_tim5.h"
#include    "Registers/stm32L4R5_tim6.h"
#include    "Registers/stm32L4R5_tim7.h"
#include    "Registers/stm32L4R5_tim8.h"
#include    "Registers/stm32L4R5_tsc.h"
#include    "Registers/stm32L4R5_uart4.h"
#include    "Registers/stm32L4R5_uart5.h"
#include    "Registers/stm32L4R5_usart1.h"
#include    "Registers/stm32L4R5_usart2.h"
#include    "Registers/stm32L4R5_usart3.h"
#include    "Registers/stm32L4R5_vref.h"
#include    "Registers/stm32L4R5_wwdg.h"
#include    "Registers/soc_addendum.h"

// IWYU pragma: end_exports
